Repository: common-repository/wc-upress-gw
Catalog: languages/wc-upress-gw-*.po
Languages: he_il

source: uPress Payment Gateway requires Woocommerce to be installed and active.
he_il: על מנת לסלוק באמצעות uPress Payment Gateway יש לוודא שווקומרס יהיה מותקן ופעיל.

source: Secure credit card payments with MAX gateway.
he_il: תשלומי כרטיסי אשראי מאובטחים באמצעות מסוף הסליקה של MAX.

source: Something went wrong while making MAX payment!
he_il: התקבלה שגיאה בתהליך התשלום!

source: Enable/Disable
he_il: הפעל/בטל

source: Enable Gateway
he_il: הפעל מסוף סליקה

source: Title
he_il: כותרת

source: This controls the title which the user sees during checkout.
he_il: שולט בכותרת שהמשתמש רואה במסך הקופה.

source: Description
he_il: תיאור

source: This controls the description which the user sees during checkout.
he_il: שולט בתיאור שהמשתמש רואה במסך הקופה.

source: Secure Credit Card Payment %s
he_il: תשלום מאובטח בכרטיס אשראי %s

source: API Key / Password Signature
he_il: קוד API / סיסמת API

source: This is the API Signature. You will got from MAX.
he_il: קוד ה- API שהתקבל מ- MAX.

source: Terminal Number
he_il: מספר מסוף

source: This is the your Term No. You will got from MAX.
he_il: מספר המסוף שהתקבל מ- MAX.

source: Payment Installments
he_il: מספר תשלומים

source: Delayed Payment
he_il: חיוב דחוי

source: No
he_il: לא

source: Yes
he_il: כן

source: Template
he_il: תבנית

source: Templates shown at <a href="%1$s" target="_blank" rel="noopener nofollow">%1$s</a>
he_il: ניתן לראות תצוגה מקדימה של התבניות בקישור הבא <a href="%1$s" target="_blank" rel="noopener nofollow">%1$s</a>

source: Show Items
he_il: הצג פריטים

source: Language
he_il: שפה

source: Hebrew
he_il: עברית

source: English
he_il: אנגלית

source: Automatic
he_il: אוטוטמי

source: Type
he_il: סוג

source: Iframe Width
he_il: רוחב iframe

source: Iframe Height
he_il: גובה iframe

source: MAX Payment Gateway by uPress
he_il: מסוף סליקה MAX מאת uPress

source: Accept all major credit cards directly on your WooCommerce site in a seamless and secure checkout environment with MAX.
he_il: קבל את כל כרטיסי האשראי העיקריים ישירות באתר WooCommerce שלך בסביבת מאובטחת באמצעות MAX.

source: Join MAX Business
he_il: להצטרפות אל MAX עסקים

source: After the registration process MAX will automatically open your payment terminal and all settings will auto-update* for your website.
he_il: לאחר תהליך ההרשמה אל MAX עסקים מסוף הסליקה שלך יפתח אוטומטית וכל ההגדרות יתעדכנו אוטומטית* באתר שלך.

source: * Automatic settings update available for uPress customers only
he_il: * עדכון הגדרות אוטומטי זמין ללקוחות uPress בלבד

source: Return URL for MAX:
he_il: כתובת להחזרה של התשובה מ- MAX:

source: Gateway Disabled
he_il: אמצעי התשלום מבוטל

source: uPress Payment Gateway does not support your store currency.
he_il: uPress Payment Gateway אינו תומך במטבע איתו החנות שלך עובדת.

source: MAX payment approved (ID: %s)
he_il: התשלום התקבל בהצלחה (ID: %s)

source: Gateway error
he_il: שגיאת אמצעי תשלום

source: Please try another payment module.
he_il: נסה להשתמש באמצעי תשלום אחר.

source: uPress Payment Gateway Response:
he_il: התקבלה תשובה לבקשת פתיחת מסוף הסליקה:

source: uPress Payment Gateway is not configured yet
he_il: uPress Payment Gateway לא מוגדר עדיין

source: Register with MAX Business
he_il: הרשם אל MAX עסקים

source: Configure uPress Payment Gateway
he_il: הגדר את uPress Payment Gateway
